Тестовая_база_ERP_14/src/Catalogs/ТипыДокументовПодтверждающихЛьготуНДС/ТипыДокументовПодтверждающихЛьготуНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыДокументовПодтверждающихЛьготуНДС</name>
  <predefined>
    <items>
      <name>Акт</name>
      <description>Акт</description>
    </items>
    <items>
      <name>Договор</name>
      <description>Договор</description>
    </items>
    <items>
      <name>Накладная</name>
      <description>Накладная</description>
    </items>
    <items>
      <name>СправкаРасчет</name>
      <description>Справка-расчет</description>
    </items>
    <items>
      <name>УПД</name>
      <description>УПД</description>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Enums/ВидыЭД/ВидыЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭД</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>АктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>ПрикладнойЭД</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйЭД</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиОтправитель</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Продавец</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДопДанные</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>АктОРасхождениях</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Catalogs/ТипыДокументовПодтверждающихЛьготуНДС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает тип документа, подтверждающего налоговую льготу по НДС.
//
// Параметры:
//  ВидЭД - ПеречислениеСсылка.ВидыЭД - вид электронного документа, указанный в документе реализации.
//
// Возвращаемое значение:
// 	СправочникСсылка.ТипыДокументовПодтверждающихЛьготуНДС - Тип документа или Неопределено.
//
Функция ТипПодтверждающегоДокументаПоВидуЭД(ВидЭД) Экспорт
	
	Если ВидЭД = Перечисления.ВидыЭД.АктВыполненныхРабот
		ИЛИ ВидЭД = Перечисления.ВидыЭД.АктЗаказчик
		ИЛИ ВидЭД = Перечисления.ВидыЭД.АктИсполнитель
		ИЛИ ВидЭД = Перечисления.ВидыЭД.АктНаПередачуПрав Тогда 
		Возврат Справочники.ТипыДокументовПодтверждающихЛьготуНДС.Акт;
	ИначеЕсли ВидЭД = Перечисления.ВидыЭД.ТОРГ12
		ИЛИ ВидЭД = Перечисления.ВидыЭД.ТОРГ12Покупатель
		ИЛИ ВидЭД = Перечисления.ВидыЭД.ТОРГ12Продавец Тогда 
		Возврат Справочники.ТипыДокументовПодтверждающихЛьготуНДС.Накладная;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик обновления 3.0.51.5
// Устанавливает полное наименование для типов документов.
Процедура УстановитьПолноеНаименование() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипыДокументовПодтверждающихЛьготуНДС.Ссылка,
	|	ВЫБОР
	|		КОГДА ТипыДокументовПодтверждающихЛьготуНДС.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументовПодтверждающихЛьготуНДС.Акт)
	|			ТОГДА &НаименованиеАкт
	|		КОГДА ТипыДокументовПодтверждающихЛьготуНДС.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументовПодтверждающихЛьготуНДС.Договор)
	|			ТОГДА &НаименованиеДоговор
	|		КОГДА ТипыДокументовПодтверждающихЛьготуНДС.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументовПодтверждающихЛьготуНДС.Накладная)
	|			ТОГДА &НаименованиеТоварнаяНакладная
	|		КОГДА ТипыДокументовПодтверждающихЛьготуНДС.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументовПодтверждающихЛьготуНДС.СправкаРасчет)
	|			ТОГДА &НаименованиеСправкаРасчет
	|		КОГДА ТипыДокументовПодтверждающихЛьготуНДС.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыДокументовПодтверждающихЛьготуНДС.УПД)
	|			ТОГДА &НаименованиеУПД
	|	КОНЕЦ КАК ПолноеНаименование
	|ИЗ
	|	Справочник.ТипыДокументовПодтверждающихЛьготуНДС КАК ТипыДокументовПодтверждающихЛьготуНДС
	|ГДЕ
	|	ТипыДокументовПодтверждающихЛьготуНДС.ПолноеНаименование = """"
	|	И ТипыДокументовПодтверждающихЛьготуНДС.Предопределенный";
	
	Запрос.УстановитьПараметр("НаименованиеАкт",               НСтр("ru = 'Акт';
																	|en = 'Certificate'"));
	Запрос.УстановитьПараметр("НаименованиеДоговор",           НСтр("ru = 'Договор';
																	|en = 'Contract'"));
	Запрос.УстановитьПараметр("НаименованиеТоварнаяНакладная", НСтр("ru = 'Товарная накладная';
																	|en = 'Invoice'"));
	Запрос.УстановитьПараметр("НаименованиеСправкаРасчет",     НСтр("ru = 'Справка-расчет';
																	|en = 'Detailed calculation'"));
	Запрос.УстановитьПараметр("НаименованиеУПД",               НСтр("ru = 'Универсальный передаточный документ';
																	|en = 'Universal transfer document'"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТипДокументаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТипДокументаОбъект.ПолноеНаименование = Выборка.ПолноеНаименование;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТипДокументаОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
